# Titanic: Machine Learning from Disaster

Data Dictionary

Variable	Definition	Key

survival	Survival	0 = No, 1 = Yes

pclass	Ticket class	1 = 1st, 2 = 2nd, 3 = 3rd

sex	Sex	

Age	Age in years	

sibsp	# of siblings / spouses aboard the Titanic	

parch	# of parents / children aboard the Titanic	

ticket	Ticket number	

fare	Passenger fare	

cabin	Cabin number	

embarked	Port of Embarkation	C = Cherbourg, Q = Queenstown, S = Southampton


Variable Notes
pclass: A proxy for socio-economic status (SES)
1st = Upper
2nd = Middle
3rd = Lower

age: Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5

sibsp: The dataset defines family relations in this way...
Sibling = brother, sister, stepbrother, stepsister
Spouse = husband, wife (mistresses and fianc√©s were ignored)

parch: The dataset defines family relations in this way...
Parent = mother, father
Child = daughter, son, stepdaughter, stepson
Some children travelled only with a nanny, therefore parch=0 for them.

In [1]:
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import pandas as pd

### Titanic Dataset from Kaggle
https://www.kaggle.com/c/titanic/data

In [8]:
ds = pd.read_csv('data/titanic.csv')
print(ds.columns)

ds.head()

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
# Count the number of NaN in each column

ds.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
cols_to_drop = ['PassengerId','Name','Ticket','Cabin','Embarked']
df = ds.drop(cols_to_drop, axis=1)

print(df.columns)
df.head()

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

In [11]:
# Drop rows that contain NaN (Mostly in the 'Age' column)

print(df.values.shape)
r_old = df.values.shape[0]

df = df.dropna(axis=0)
print(df.values.shape)
r_new = df.values.shape[0]

print(f'{r_old-r_new} rows dropped')

(891, 7)
(714, 7)
177 rows dropped

In [12]:
sex_mapping = {
    'male' : 0,
    'female': 1,
}
df.Sex = df.Sex.map(sex_mapping)

df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    0  22.0      1      0   7.2500
1         1       1    1  38.0      1      0  71.2833
2         1       3    1  26.0      0      0   7.9250
3         1       1    1  35.0      1      0  53.1000
4         0       3    0  35.0      0      0   8.0500

In [13]:
data = df.values

## Split into Test and Training
split = int(0.80*data.shape[0])

X_train = data[:split,1:]
X_test = data[split:, 1:]

Y_train = data[:split, 0]
Y_test = data[split:, 0]

print(X_train.shape)
print(X_test.shape)

print(Y_train.shape)
print(Y_test.shape)

(571, 6)
(143, 6)
(571,)
(143,)

Logistic Regression

In [25]:
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression(solver='lbfgs')
clf = lr.fit(X_train, Y_train)
lr.score(X_test, Y_test)*100

81.81818181818183

In [26]:
clf.predict_proba(X_train[0:3, :])

array([[0.89200638, 0.10799362],
       [0.10105033, 0.89894967],
       [0.37784585, 0.62215415]])